Revit 2026 API

# ZoneEquipmentGetAssociatedZoneEquipment(Document, ISetElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> GetAssociatedZoneEquipment(
	Document document,
	ISet<ElementId> spaces
)
```
```vb
Public Shared Function GetAssociatedZoneEquipment (
	document As Document,
	spaces As ISet(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ GetAssociatedZoneEquipment(
	Document^ document,
	ISet<ElementId^>^ spaces
)
```
```fsharp
static member GetAssociatedZoneEquipment :
        document : Document *
        spaces : ISet<ElementId> -> ISet<ElementId>
```

#### Parameters

document Document

spaces ISetElementId

#### Return Value

ISetElementId

#### Reference

ZoneEquipment Class

GetAssociatedZoneEquipment Overload

Autodesk.Revit.DB.Mechanical Namespace